; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_3)
(:domain joint_bar)
(:objects
    link1 link2 link3 - link
    angle0 angle20 angle40 angle60 angle80 angle100 angle120 angle140 angle160 angle180 angle200 angle220 angle240 angle260 angle280 angle300 angle320 angle340 - angle)
(:init
    (AngleOrd angle0 angle20)
    (AngleOrd angle20 angle40)
    (AngleOrd angle40 angle60)
    (AngleOrd angle60 angle80)
    (AngleOrd angle80 angle100)
    (AngleOrd angle100 angle120)
    (AngleOrd angle120 angle140)
    (AngleOrd angle140 angle160)
    (AngleOrd angle160 angle180)
    (AngleOrd angle180 angle200)
    (AngleOrd angle200 angle220)
    (AngleOrd angle220 angle240)
    (AngleOrd angle240 angle260)
    (AngleOrd angle260 angle280)
    (AngleOrd angle280 angle300)
    (AngleOrd angle300 angle320)
    (AngleOrd angle320 angle340)
    (AngleOrd angle340 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)

    (HasAngle angle220 link1)
    (HasAngle angle180 link2)
    (HasAngle angle40 link3)
)
(:goal
(and
    (HasAngle angle160 link1)
    (HasAngle angle320 link2)
    (HasAngle angle120 link3)
    )
)
)

; plan
1. (decrease_angle link1 angle220 angle200)
   deleted: (hasangle angle220 link1) (hasangle angle180 link2) (hasangle angle40 link3)
   added: (hasangle angle200 link1) (hasangle angle160 link2) (hasangle angle20 link3)
   goals met: 0 of 3
2. (decrease_angle link1 angle200 angle180)
   deleted: (hasangle angle200 link1) (hasangle angle160 link2) (hasangle angle20 link3)
   added: (hasangle angle180 link1) (hasangle angle140 link2) (hasangle angle0 link3)
   goals met: 0 of 3
3. (decrease_angle link1 angle180 angle160)
   deleted: (hasangle angle180 link1) (hasangle angle140 link2) (hasangle angle0 link3)
   added: (hasangle angle160 link1) (hasangle angle120 link2) (hasangle angle340 link3)
   goals met: 1 of 3
4. (decrease_angle link2 angle120 angle100)
   deleted: (hasangle angle120 link2) (hasangle angle340 link3)
   added: (hasangle angle100 link2) (hasangle angle320 link3)
   goals met: 1 of 3
5. (decrease_angle link2 angle100 angle80)
   deleted: (hasangle angle100 link2) (hasangle angle320 link3)
   added: (hasangle angle80 link2) (hasangle angle300 link3)
   goals met: 1 of 3
6. (decrease_angle link2 angle80 angle60)
   deleted: (hasangle angle80 link2) (hasangle angle300 link3)
   added: (hasangle angle60 link2) (hasangle angle280 link3)
   goals met: 1 of 3
7. (decrease_angle link2 angle60 angle40)
   deleted: (hasangle angle60 link2) (hasangle angle280 link3)
   added: (hasangle angle40 link2) (hasangle angle260 link3)
   goals met: 1 of 3
8. (decrease_angle link2 angle40 angle20)
   deleted: (hasangle angle40 link2) (hasangle angle260 link3)
   added: (hasangle angle20 link2) (hasangle angle240 link3)
   goals met: 1 of 3
9. (decrease_angle link2 angle20 angle0)
   deleted: (hasangle angle20 link2) (hasangle angle240 link3)
   added: (hasangle angle0 link2) (hasangle angle220 link3)
   goals met: 1 of 3
10. (decrease_angle link2 angle0 angle340)
   deleted: (hasangle angle0 link2) (hasangle angle220 link3)
   added: (hasangle angle340 link2) (hasangle angle200 link3)
   goals met: 1 of 3
11. (decrease_angle link2 angle340 angle320)
   deleted: (hasangle angle340 link2) (hasangle angle200 link3)
   added: (hasangle angle320 link2) (hasangle angle180 link3)
   goals met: 2 of 3
12. (decrease_angle link3 angle180 angle160)
   deleted: (hasangle angle180 link3)
   added: (hasangle angle160 link3)
   goals met: 2 of 3
13. (decrease_angle link3 angle160 angle140)
   deleted: (hasangle angle160 link3)
   added: (hasangle angle140 link3)
   goals met: 2 of 3
14. (decrease_angle link3 angle140 angle120)
   deleted: (hasangle angle140 link3)
   added: (hasangle angle120 link3)
   goals met: 3 of 3
